In [2]:
#installing libraries
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset

#Data Loading
dataset = load_dataset("lukebarousse/data_jobs")
df = dataset['train'].to_pandas()

#Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [7]:
df.loc[:, "salary_rate":"salary_hour_avg"].dropna(subset = "salary_rate")

       salary_rate  salary_year_avg  salary_hour_avg
28            year         109500.0              NaN
43            hour              NaN             97.5
51            hour              NaN             72.5
77            year         140000.0              NaN
92            year         120000.0              NaN
...            ...              ...              ...
785624        year         139216.0              NaN
785641        year         150000.0              NaN
785648        year         221875.0              NaN
785682        year         157500.0              NaN
785692        year         157500.0              NaN

[33067 rows x 3 columns]

In [9]:
median_salary_year = df['salary_year_avg'].median()

In [10]:
median_salary_hour = df['salary_hour_avg'].median()

In [46]:
df_filled = df
# df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year )
# df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour )
df_filled['salary_year_avg']

0         115000.0
1         115000.0
2         115000.0
3         115000.0
4         115000.0
            ...
785736    115000.0
785737    115000.0
785738    115000.0
785739    115000.0
785740    115000.0
Name: salary_year_avg, Length: 785741, dtype: float64

In [44]:
df_filled.loc[: , "salary_rate":"salary_hour_avg"]

       salary_rate  salary_year_avg  salary_hour_avg
0             None         115000.0            45.98
1             None         115000.0            45.98
2             None         115000.0            45.98
3             None         115000.0            45.98
4             None         115000.0            45.98
...            ...              ...              ...
785736        None         115000.0            45.98
785737        None         115000.0            45.98
785738        None         115000.0            45.98
785739        None         115000.0            45.98
785740        None         115000.0            45.98

[785741 rows x 3 columns]

In [38]:
df_unique = df_filled
df_unique = df_unique.drop_duplicates()

In [39]:
df_unique = df_unique.drop_duplicates(subset = ["job_title", "company_name"])

In [42]:
df.pivot_table(values="salary_year_avg", index="job_country", columns="job_title_short", aggfunc='median')

job_title_short,Business Analyst,Cloud Engineer,Data Analyst,Data Engineer,Data Scientist,Machine Learning Engineer,Senior Data Analyst,Senior Data Engineer,Senior Data Scientist,Software Engineer
job_country,,,,,,,,,,
Afghanistan,115000.0,NaN,115000.0,NaN,115000.0,NaN,115000.0,NaN,NaN,NaN
Albania,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0
Algeria,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,NaN,115000.0,NaN,115000.0
Angola,115000.0,NaN,115000.0,115000.0,115000.0,NaN,NaN,NaN,115000.0,115000.0
Argentina,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0
...,...,...,...,...,...,...,...,...,...,...
Venezuela,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0
Vietnam,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0
Yemen,115000.0,NaN,115000.0,115000.0,NaN,NaN,NaN,NaN,NaN,115000.0
Zambia,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,NaN,115000.0,115000.0
Zimbabwe,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0,115000.0

In [35]:
top_countries = df['job_country'].value_counts().head(6).index

df_job_country_salary = df.pivot_table(
    values="salary_year_avg", 
    index="job_country", 
    columns="job_title_short", 
    aggfunc="median")

df_job_country_salary = df_job_country_salary.loc[top_countries]
job_titles = ['Data Analyst', 'Data Engineer', 'Data Scientist']
df_job_country_salary = df_job_country_salary[job_titles]
df_job_country_salary 
# df_job_country_salary.plot(kind='bar')
# plt.ylabel('Median Salary (USD $)')
# plt.xlabel('')
# plt.xticks(rotation=45, ha = 'right')
# plt.show()

job_title_short  Data Analyst  Data Engineer  Data Scientist
job_country
United States        115000.0       115000.0        115000.0
India                115000.0       115000.0        115000.0
United Kingdom       115000.0       115000.0        115000.0
France               115000.0       115000.0        115000.0
Germany              115000.0       115000.0        115000.0
Spain                115000.0       115000.0        115000.0